MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GB002/mcu.h
/* DSGPR0 */
/* Bitname _DSGPR cannot be defined because it is used by more than one SFR */
/* Bitname _DSGPR0 cannot be defined because it is used by more than one SFR */
/* Bitname _DSGPR1 cannot be defined because it is used by more than one SFR */
/* Bitname _DSGPR2 cannot be defined because it is used by more than one SFR */
/* Bitname _DSGPR3 cannot be defined because it is used by more than one SFR */
/* Bitname _DSGPR4 cannot be defined because it is used by more than one SFR */
/* Bitname _DSGPR5 cannot be defined because it is used by more than one SFR */
/* Bitname _DSGPR6 cannot be defined because it is used by more than one SFR */
/* Bitname _DSGPR7 cannot be defined because it is used by more than one SFR */
/* Bitname _DSGPR8 cannot be defined because it is used by more than one SFR */
/* Bitname _DSGPR9 cannot be defined because it is used by more than one SFR */
/* Bitname _DSGPR10 cannot be defined because it is used by more than one SFR */
/* Bitname _DSGPR11 cannot be defined because it is used by more than one SFR */
/* Bitname _DSGPR12 cannot be defined because it is used by more than one SFR */
/* Bitname _DSGPR13 cannot be defined because it is used by more than one SFR */
/* Bitname _DSGPR14 cannot be defined because it is used by more than one SFR */
/* Bitname _DSGPR15 cannot be defined because it is used by more than one SFR */

/* DSGPR1 */
/* Bitname _DSGPR cannot be defined because it is used by more than one SFR */
/* Bitname _DSGPR0 cannot be defined because it is used by more than one SFR */
/* Bitname _DSGPR1 cannot be defined because it is used by more than one SFR */
/* Bitname _DSGPR2 cannot be defined because it is used by more than one SFR */
/* Bitname _DSGPR3 cannot be defined because it is used by more than one SFR */
/* Bitname _DSGPR4 cannot be defined because it is used by more than one SFR */
/* Bitname _DSGPR5 cannot be defined because it is used by more than one SFR */
/* Bitname _DSGPR6 cannot be defined because it is used by more than one SFR */
/* Bitname _DSGPR7 cannot be defined because it is used by more than one SFR */
/* Bitname _DSGPR8 cannot be defined because it is used by more than one SFR */
/* Bitname _DSGPR9 cannot be defined because it is used by more than one SFR */
/* Bitname _DSGPR10 cannot be defined because it is used by more than one SFR */
/* Bitname _DSGPR11 cannot be defined because it is used by more than one SFR */
/* Bitname _DSGPR12 cannot be defined because it is used by more than one SFR */
/* Bitname _DSGPR13 cannot be defined because it is used by more than one SFR */
/* Bitname _DSGPR14 cannot be defined because it is used by more than one SFR */
/* Bitname _DSGPR15 cannot be defined because it is used by more than one SFR */

/* NVMCON */
#define _NVMOP NVMCONbits.NVMOP
#define _ERASE NVMCONbits.ERASE
#define _WRERR NVMCONbits.WRERR
#define _WREN NVMCONbits.WREN
#define _WR NVMCONbits.WR
#define _NVMOP0 NVMCONbits.NVMOP0
#define _NVMOP1 NVMCONbits.NVMOP1
#define _NVMOP2 NVMCONbits.NVMOP2
#define _NVMOP3 NVMCONbits.NVMOP3
#define _PROGOP0 NVMCONbits.PROGOP0
#define _PROGOP1 NVMCONbits.PROGOP1
#define _PROGOP2 NVMCONbits.PROGOP2
#define _PROGOP3 NVMCONbits.PROGOP3
#define _PROGOP NVMCONbits.PROGOP

/* PMD1 */
#define _ADC1MD PMD1bits.ADC1MD
#define _SPI1MD PMD1bits.SPI1MD
#define _SPI2MD PMD1bits.SPI2MD
#define _U1MD PMD1bits.U1MD
#define _U2MD PMD1bits.U2MD
#define _I2C1MD PMD1bits.I2C1MD
#define _T1MD PMD1bits.T1MD
#define _T2MD PMD1bits.T2MD
#define _T3MD PMD1bits.T3MD
#define _T4MD PMD1bits.T4MD
#define _T5MD PMD1bits.T5MD

/* PMD2 */
#define _OC1MD PMD2bits.OC1MD
#define _OC2MD PMD2bits.OC2MD
#define _OC3MD PMD2bits.OC3MD
#define _OC4MD PMD2bits.OC4MD
#define _OC5MD PMD2bits.OC5MD
#define _IC1MD PMD2bits.IC1MD
#define _IC2MD PMD2bits.IC2MD
#define _IC3MD PMD2bits.IC3MD
#define _IC4MD PMD2bits.IC4MD
#define _IC5MD PMD2bits.IC5MD

/* PMD3 */
#define _I2C2MD PMD3bits.I2C2MD
#define _CRCMD PMD3bits.CRCMD
#define _PMPMD PMD3bits.PMPMD
#define _RTCCMD PMD3bits.RTCCMD
#define _CMPMD PMD3bits.CMPMD
#define _CRCPMD PMD3bits.CRCPMD

/* PMD4 */
#define _USB1MD PMD4bits.USB1MD
#define _LVDMD PMD4bits.LVDMD
#define _CTMUMD PMD4bits.CTMUMD
#define _REFOMD PMD4bits.REFOMD
#define _UPWMMD PMD4bits.UPWMMD


/*----------------------------------------------------------- */
/* Some useful macros for allocating data memory              */
/*----------------------------------------------------------- */

/* The following macros require an argument N that specifies  */
/* alignment. N must a power of two, minimum value = 2.       */
/* For example, to declare an uninitialized array that is     */
/* aligned to a 32 byte address:                              */
/*                                                            */
/* int _BSS(32) buf[16];                                      */
/*                                                            */
/* To declare an initialized array without special            */
/* alignment:                                                 */
/*                                                            */
/* int _DATA(2) table1[] = {0, 1, 1, 2, 3, 5, 8, 13, 21};     */
/*                                                            */
#define _BSS(N)    __attribute__((aligned(N)))
#define _DATA(N)   __attribute__((aligned(N)))

/* The following macros do not require an argument. They can  */
/* be used to locate a variable in persistent data memory or  */
/* in near data memory. For example, to declare two variables */
/* that retain their values across a device reset:            */
/*                                                            */
/* int _PERSISTENT var1,var2;                                 */
/*                                                            */
#define _PERSISTENT __attribute__((persistent))
#define _NEAR       __attribute__((near))

/* ---------------------------------------------------------- */
/* Some useful macros for declaring functions                 */
/* ---------------------------------------------------------- */

/* The following macros can be used to declare interrupt      */
/* service routines (ISRs). For example, to declare an ISR    */
/* for the timer1 interrupt:                                  */
/*                                                            */
/* void _ISR _T1Interrupt(void);                              */
/*                                                            */
/* To declare an ISR for the SPI1 interrupt with fast         */
/* context save:                                              */
/*                                                            */
/* void _ISRFAST _SPI1Interrupt(void);                        */
/*                                                            */
/* Note: ISRs will be installed into the interrupt vector     */
/* tables automatically if the reserved names listed in the   */
/* MPLAB C30 Compiler User's Guide (DS51284) are used.        */
/*                                                            */
#define _ISR __attribute__((interrupt))
#define _ISRFAST __attribute__((interrupt, shadow))

/* ---------------------------------------------------------- */
/* Some useful macros for changing the CPU IPL                */
/* ---------------------------------------------------------- */

