MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GB002/mcu.h
#define WPFP_WPFP0           0xFFC0
#define WPFP_WPFP1           0xFFC1
#define WPFP_WPFP2           0xFFC2
#define WPFP_WPFP3           0xFFC3
#define WPFP_WPFP4           0xFFC4
#define WPFP_WPFP5           0xFFC5
#define WPFP_WPFP6           0xFFC6
#define WPFP_WPFP7           0xFFC7
#define WPFP_WPFP8           0xFFC8
#define WPFP_WPFP9           0xFFC9
#define WPFP_WPFP10          0xFFCA
#define WPFP_WPFP11          0xFFCB
#define WPFP_WPFP12          0xFFCC
#define WPFP_WPFP13          0xFFCD
#define WPFP_WPFP14          0xFFCE
#define WPFP_WPFP15          0xFFCF
#define WPFP_WPFP16          0xFFD0
#define WPFP_WPFP17          0xFFD1
#define WPFP_WPFP18          0xFFD2
#define WPFP_WPFP19          0xFFD3
#define WPFP_WPFP20          0xFFD4
#define WPFP_WPFP21          0xFFD5
#define WPFP_WPFP22          0xFFD6
#define WPFP_WPFP23          0xFFD7
#define WPFP_WPFP24          0xFFD8
#define WPFP_WPFP25          0xFFD9
#define WPFP_WPFP26          0xFFDA
#define WPFP_WPFP27          0xFFDB
#define WPFP_WPFP28          0xFFDC
#define WPFP_WPFP29          0xFFDD
#define WPFP_WPFP30          0xFFDE
#define WPFP_WPFP31          0xFFDF
#define WPFP_WPFP32          0xFFE0
#define WPFP_WPFP33          0xFFE1
#define WPFP_WPFP34          0xFFE2
#define WPFP_WPFP35          0xFFE3
#define WPFP_WPFP36          0xFFE4
#define WPFP_WPFP37          0xFFE5
#define WPFP_WPFP38          0xFFE6
#define WPFP_WPFP39          0xFFE7
#define WPFP_WPFP40          0xFFE8
#define WPFP_WPFP41          0xFFE9
#define WPFP_WPFP42          0xFFEA
#define WPFP_WPFP63          0xFFFF

#define SOSCSEL_IO           0xFCFF
#define SOSCSEL_LPSOSC       0xFDFF
#define SOSCSEL_SOSC         0xFFFF

#define WUTSEL_FST           0xF7FF
#define WUTSEL_LEG           0xFFFF

#define WPDIS_WPEN           0xDFFF
#define WPDIS_WPDIS          0xFFFF

#define WPCFG_WPCFGEN        0xBFFF
#define WPCFG_WPCFGDIS       0xFFFF

#define WPEND_WPSTARTMEM     0x7FFF
#define WPEND_WPENDMEM       0xFFFF

/* Register CONFIG2 (0xabfc)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _CONFIG2;
#define _CONFIG2(x) __attribute__((address(0xabfc),deprecated_definition("consider migrating to #pragma config"),section("__CONFIG2.sec"),space(prog))) __prog__ uint16_t _CONFIG2 = (x);

/*
** Only one invocation of CONFIG2 should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set CONFIG2.
** Multiple options may be combined, as shown:
**
** _CONFIG2( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Primary Oscillator Select:
**     POSCMOD_EC           EC Oscillator mode selected
**     POSCMOD_XT           XT Oscillator mode selected
**     POSCMOD_HS           HS Oscillator mode selected
**     POSCMOD_NONE         Primary Oscillator disabled
**
**   I2C1 Pin Select bit:
**     I2C1SEL_SEC          Use alternate SCL1/SDA1 pins for I2C1
**     I2C1SEL_PRI          Use default SCL1/SDA1 pins for I2C1 
**
**   IOLOCK One-Way Set Enable:
**     IOL1WAY_OFF          The IOLOCK bit can be set and cleared using the unlock sequence
**     IOL1WAY_ON           Once set, the IOLOCK bit cannot be cleared
**
**   OSCO Pin Configuration:
**     OSCIOFNC_ON          OSCO pin functions as port I/O (RA3)
**     OSCIOFNC_OFF         OSCO pin functions as clock output (CLKO)
**
**   Clock Switching and Fail-Safe Clock Monitor:
**     FCKSM_CSECME         Sw Enabled, Mon Enabled
**     FCKSM_CSECMD         Sw Enabled, Mon Disabled
**     FCKSM_CSDCMD         Sw Disabled, Mon Disabled
**
**   Initial Oscillator Select:
**     FNOSC_FRC            Fast RC Oscillator (FRC)
**     FNOSC_FRCPLL         Fast RC Oscillator with Postscaler and PLL module (FRCPLL)
**     FNOSC_PRI            Primary Oscillator (XT, HS, EC)
**     FNOSC_PRIPLL         Primary Oscillator with PLL module (XTPLL, HSPLL, ECPLL)
**     FNOSC_SOSC           Secondary Oscillator (SOSC)
**     FNOSC_LPRC           Low-Power RC Oscillator (LPRC)
**     FNOSC_FRCDIV         Fast RC Oscillator with Postscaler (FRCDIV)
**
**   96MHz PLL Startup Select:
**     PLL96MHZ_OFF         96 MHz PLL Startup is enabled by user in software( controlled with the PLLEN bit)
**     PLL96MHZ_ON          96 MHz PLL Startup is enabled automatically on start-up
**
**   USB 96 MHz PLL Prescaler Select:
**     PLLDIV_NODIV         Oscillator input used directly (4 MHz input)
**     PLLDIV_DIV2          Oscillator input divided by 2 (8 MHz input)
**     PLLDIV_DIV3          Oscillator input divided by 3 (12 MHz input)
**     PLLDIV_DIV4          Oscillator input divided by 4 (16 MHz input)
**     PLLDIV_DIV5          Oscillator input divided by 5 (20 MHz input)
**     PLLDIV_DIV6          Oscillator input divided by 6 (24 MHz input)
**     PLLDIV_DIV8          Oscillator input divided by 8 (32 MHz input)
**     PLLDIV_DIV12         Oscillator input divided by 12 (48 MHz input)
**
**   Internal External Switchover:
**     IESO_OFF             IESO mode (Two-Speed Start-up) disabled
**     IESO_ON              IESO mode (Two-Speed Start-up) enabled
**
*/

#define POSCMOD_EC           0xFFFC
#define POSCMOD_XT           0xFFFD
#define POSCMOD_HS           0xFFFE
#define POSCMOD_NONE         0xFFFF

#define I2C1SEL_SEC          0xFFFB
#define I2C1SEL_PRI          0xFFFF

#define IOL1WAY_OFF          0xFFEF
#define IOL1WAY_ON           0xFFFF

#define OSCIOFNC_ON          0xFFDF
#define OSCIOFNC_OFF         0xFFFF

#define FCKSM_CSECME         0xFF3F
#define FCKSM_CSECMD         0xFF7F
#define FCKSM_CSDCMD         0xFFBF

#define FNOSC_FRC            0xF8FF
#define FNOSC_FRCPLL         0xF9FF
#define FNOSC_PRI            0xFAFF
#define FNOSC_PRIPLL         0xFBFF
#define FNOSC_SOSC           0xFCFF
#define FNOSC_LPRC           0xFDFF
#define FNOSC_FRCDIV         0xFFFF

#define PLL96MHZ_OFF         0xF7FF
#define PLL96MHZ_ON          0xFFFF

#define PLLDIV_NODIV         0x8FFF
#define PLLDIV_DIV2          0x9FFF
#define PLLDIV_DIV3          0xAFFF
#define PLLDIV_DIV4          0xBFFF
#define PLLDIV_DIV5          0xCFFF
#define PLLDIV_DIV6          0xDFFF
#define PLLDIV_DIV8          0xEFFF
#define PLLDIV_DIV12         0xFFFF

#define IESO_OFF             0x7FFF
#define IESO_ON              0xFFFF

/* Register CONFIG1 (0xabfe)                               */

